import React from 'react'
import Title from '../components/Title'
import { assets } from '../assets/assets'
import NewsletterBox from '../components/NewsletterBox'

const About = () => {
  return (
    <div>
      
      <div className='text-2xl text-center pt-8 border-t'>
        <Title text1={'เกี่ยวกับ'} text2={'เรา'}/>
      </div>

      <div className='my-10 flex flex-col md:flex-row gap-16'>
        <img className='w-full md:max-w-[450px]' src={assets.เครื่องมือ} alt='' />
        <div className='flex flex-col justify-center gap-6 md:w-2/4 text-gray-600'>
          <p>ยินดีต้อนรับสู่ร้านวัสดุก่อสร้างของเรา! เราเป็นร้านค้าที่มุ่งเน้นการจัดจำหน่ายวัสดุก่อสร้างคุณภาพสูงสำหรับทุกโครงการ ไม่ว่าจะเป็นงานก่อสร้างบ้านพักอาศัย โครงการอาคารพาณิชย์ หรือแม้กระทั่งงานซ่อมแซมขนาดเล็ก เราเข้าใจดีว่าคุณภาพและความทนทานของวัสดุคือสิ่งสำคัญที่สุดในการก่อสร้าง นั่นคือเหตุผลที่เราเลือกสรรสินค้าที่มีมาตรฐานสูงและคัดสรรจากผู้ผลิตชั้นนำมาให้คุณได้เลือกใช้.</p>
          <p>เราให้บริการที่ใส่ใจและพร้อมให้คำปรึกษาด้านวัสดุก่อสร้างโดยผู้เชี่ยวชาญ เพื่อช่วยคุณในการตัดสินใจเลือกใช้วัสดุที่เหมาะสมกับความต้องการ ไม่ว่าคุณจะเป็นผู้รับเหมา วิศวกร สถาปนิก หรือเจ้าของบ้าน เรามีสินค้าหลากหลายที่พร้อมตอบโจทย์ทุกความต้องการ ทั้งปูนซีเมนต์ เหล็กเส้น อิฐ หิน ทราย และอุปกรณ์อื่น ๆ ครบครันในที่เดียว.</p>
          <b className='text-gray-800'>เป้าหมายของเรา</b>
          <p> เรามุ่งมั่นในการพัฒนาบริการเพื่อให้ลูกค้าของเราได้รับความสะดวกสบายมากยิ่งขึ้น ไม่ว่าจะเป็นบริการจัดส่งถึงที่ ความรวดเร็วในการตอบสนองความต้องการ หรือการจัดหาวัสดุพิเศษตามที่คุณต้องการ เราพร้อมที่จะเป็นพันธมิตรที่คุณไว้วางใจได้สำหรับโครงการก่อสร้างทุกประเภท.</p>
        </div>
      </div>

      <div className='text-4xl py-4'>
        <Title text1={'ทำไม'} text2={'ต้องเลือกเรา'}/>
      </div>

      <div className='flex flex-col md:flex-row text-sm mb-20 '>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>สินค้าคุณภาพสูง มาตรฐานระดับสากล</b>
          <p className='text-gray-600'>เราคัดสรรวัสดุก่อสร้างที่มีคุณภาพและได้มาตรฐานจากผู้ผลิตชั้นนำเท่านั้น เพื่อให้มั่นใจได้ว่าสินค้าที่คุณเลือกใช้นั้นจะมีความทนทานและเหมาะสมกับทุกโครงการก่อสร้างของคุณ</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>บริการให้คำปรึกษาจากผู้เชี่ยวชาญ</b>
          <p className='text-gray-600'>ทีมงานของเราพร้อมให้คำปรึกษาเกี่ยวกับการเลือกวัสดุที่เหมาะสม โดยมีผู้เชี่ยวชาญที่เข้าใจเรื่องวัสดุก่อสร้างเป็นอย่างดี ช่วยคุณตัดสินใจได้อย่างมั่นใจ ไม่ว่าจะเป็นโครงการขนาดเล็กหรือขนาดใหญ่</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>บริการครบวงจรและจัดส่งรวดเร็ว</b>
          <p className='text-gray-600'>นอกจากสินค้าวัสดุก่อสร้างที่หลากหลาย เรายังมีบริการจัดส่งที่รวดเร็วถึงหน้างาน เพื่อความสะดวกสบายของคุณ ช่วยให้โครงการของคุณดำเนินไปได้อย่างราบรื่นและทันตามกำหนด</p>
        </div>
      </div>

      <NewsletterBox />

    </div>
  )
}

export default About